package bb.com.a.dao;

import java.util.List;

import bb.com.a.model.Bb_AddrDto;
import bb.com.a.model.Bb_BurgerDto;
import bb.com.a.model.Bb_IngredientDto;
import bb.com.a.model.Bb_MemberDto;

public interface BbBurgerDao {
	
	/*----------------------------------------------------------------------------
	 * 버거 추가
	 * ----------------------------------------------------------------------------*/
  public boolean addBurger(Bb_BurgerDto burgerdto);
  
  /*----------------------------------------------------------------------------
   * 버거 수정
   * ----------------------------------------------------------------------------*/
  public void updBurger(Bb_BurgerDto burgerdto);
	
  /*----------------------------------------------------------------------------
   * 버거 불러오기 (특정 버거)
   * ----------------------------------------------------------------------------*/
  public Bb_BurgerDto getBurger(int seq);
  
  /*----------------------------------------------------------------------------
   * 버거 리스트 불러오기 (Diy 버거)
   * ----------------------------------------------------------------------------*/
  public List<Bb_BurgerDto> getBurgerList_diy(int creator);
  
  /*----------------------------------------------------------------------------
   * 버거 리스트 불러오기 (Default버거)
   * ----------------------------------------------------------------------------*/
  public List<Bb_BurgerDto> getBurgerList_default();
  
  /*----------------------------------------------------------------------------
   * 버거 리스트 불러오기 (Default, Diy버거)
   * ----------------------------------------------------------------------------*/
  public List<Bb_BurgerDto> getBurgerList_total(int creator);
  
  /*----------------------------------------------------------------------------
   * 모든 재료 불러오기
   * ----------------------------------------------------------------------------*/
  public List<Bb_IngredientDto> getIngredientList();

  
  



}
